fpistm/Arduino_Core_STM32L4/system/libstm32l4/source/uart.c
/**
  ******************************************************************************
  * @file    uart.c
  * @author  WI6LABS
  * @version V1.0.0
  * @date    15-Febrary-2016
  * @brief   provide the UART interface
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2015 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/** @addtogroup CMSIS
  * @{
  */

/** @addtogroup stm32l4xx_system
  * @{
  */

/** @addtogroup STM32L4xx_System_Private_Includes
  * @{
  */
#include "stm32l4xx.h"
#include "hw_config.h"
#include "uart.h"
#include "uart_emul.h"
#include "timer.h"
#include "digital_io.h"
#include "interrupt.h"

#ifdef __cplusplus
 extern "C" {
#endif

/**
  * @}
  */

/** @addtogroup STM32L4xx_System_Private_Defines
  * @{
  */

/// @brief number of received characters
#define EMUL_TIMER_PERIOD 100

/**
  * @}
  */

/** @addtogroup STM32L4xx_System_Private_TypesDefinitions
  * @{
  */

/// @brief defines the global attributes of the UART
typedef struct {
  USART_TypeDef * usart_typedef;
  IRQn_Type       irqtype;
  GPIO_TypeDef  *tx_port;
  GPIO_InitTypeDef tx_pin;
  GPIO_TypeDef  *rx_port;
  GPIO_InitTypeDef rx_pin;
  void (*uart_clock_init)(void);
  void (*uart_force_reset)(void);
  void (*uart_release_reset)(void);
  void (*gpio_tx_clock_init)(void);
  void (*gpio_rx_clock_init)(void);
  uint8_t rxpData[UART_RCV_SIZE];
  volatile uint32_t data_available;
  volatile uint8_t begin;
  volatile uint8_t end;
  uart_option_e uart_option;
}uart_conf_t;

typedef struct {
  UART_Emul_TypeDef uartEmul_typedef;
  GPIO_TypeDef  *tx_port;
  GPIO_InitTypeDef tx_pin;
  GPIO_TypeDef  *rx_port;
  GPIO_InitTypeDef rx_pin;
  void (*gpio_tx_clock_init)(void);
  void (*gpio_rx_clock_init)(void);
  void (*uart_rx_irqHandle)(void);
  uint8_t rxpData[UART_RCV_SIZE];
  volatile uint32_t data_available;
  volatile uint8_t begin;
  volatile uint8_t end;
  uart_option_e uart_option;
}uart_emul_conf_t;

/**
  * @}
  */

/** @addtogroup STM32L4xx_System_Private_Macros
  * @{
  */
static void usart1_clock_enable(void)   { __USART1_CLK_ENABLE(); }
static void usart1_force_reset(void)    { __USART1_FORCE_RESET(); }
static void usart1_release_reset(void)  { __USART1_RELEASE_RESET(); }
static void usart2_clock_enable(void)   { __USART2_CLK_ENABLE(); }
static void usart2_force_reset(void)    { __USART2_FORCE_RESET(); }
static void usart2_release_reset(void)  { __USART2_RELEASE_RESET(); }
static void uart4_clock_enable(void)    { __UART4_CLK_ENABLE(); }
static void uart4_force_reset(void)     { __UART4_FORCE_RESET(); }
static void uart4_release_reset(void)   { __UART4_RELEASE_RESET(); }
static void gpioa_clock_enable(void)    { __GPIOA_CLK_ENABLE(); }
static void gpiob_clock_enable(void)    { __GPIOB_CLK_ENABLE(); }

/**
  * @}
  */

/** @addtogroup STM32L4xx_System_Private_Variables
  * @{
  */
/// @brief uart caracteristics
static UART_HandleTypeDef g_UartHandle[NB_UART_MANAGED];

static uart_conf_t g_uart_config[NB_UART_MANAGED] = {
  //USART1 (PA9/PA10)
  {
    //UART ID and IRQ
    .usart_typedef = USART1, .irqtype = USART1_IRQn,
    //tx pin configuration
    .tx_port = GPIOA, .tx_pin = {GPIO_PIN_9, GPIO_MODE_AF_PP, GPIO_NOPULL, GPIO_SPEED_HIGH, GPIO_AF7_USART1},
    //rx pin configuration
    .rx_port = GPIOA, .rx_pin = {GPIO_PIN_10, GPIO_MODE_AF_PP, GPIO_NOPULL, GPIO_SPEED_HIGH, GPIO_AF7_USART1},
    //uart clock init
    .uart_clock_init = usart1_clock_enable,
    //uart force reset
    .uart_force_reset = usart1_force_reset,
    //uart release reset
    .uart_release_reset = usart1_release_reset,
    //TX gpio clock init
    .gpio_tx_clock_init = gpioa_clock_enable,
    //RX gpio clock init
    .gpio_rx_clock_init = gpioa_clock_enable,
    .data_available = 0,
    .begin = 0,
    .end = 0,
    .uart_option = NATIVE_UART_E
  },
  //USART2 (PA2/PA3)
  {
    .usart_typedef = USART2, .irqtype = USART2_IRQn,
    //tx pin configuration
    .tx_port = GPIOA, .tx_pin = {GPIO_PIN_2, GPIO_MODE_AF_PP, GPIO_PULLUP, GPIO_SPEED_FREQ_MEDIUM, GPIO_AF7_USART2},
    //rx pin configuration
    .rx_port = GPIOA, .rx_pin = {GPIO_PIN_3, GPIO_MODE_AF_PP, GPIO_PULLUP, GPIO_SPEED_FREQ_MEDIUM, GPIO_AF7_USART2},
    //uart clock init
    .uart_clock_init = usart2_clock_enable,
    //uart force reset
    .uart_force_reset = usart2_force_reset,
    //uart release reset
    .uart_release_reset = usart2_release_reset,
    //TX gpio clock init
    .gpio_tx_clock_init = gpioa_clock_enable,
    //RX gpio clock init
    .gpio_rx_clock_init = gpioa_clock_enable,
    .data_available = 0,
    .begin = 0,
    .end = 0,
    .uart_option = NATIVE_UART_E
  },
  //UART4 (PA0/PA1)
  {
    .usart_typedef = UART4, .irqtype = UART4_IRQn,
    //tx pin configuration
    .tx_port = GPIOA, .tx_pin = {GPIO_PIN_0, GPIO_MODE_AF_PP, GPIO_PULLUP, GPIO_SPEED_FREQ_MEDIUM, GPIO_AF8_UART4},
    //rx pin configuration
    .rx_port = GPIOA, .rx_pin = {GPIO_PIN_1, GPIO_MODE_AF_PP, GPIO_PULLUP, GPIO_SPEED_FREQ_MEDIUM, GPIO_AF8_UART4},
    //uart clock init
    .uart_clock_init = uart4_clock_enable,
    //uart force reset
    .uart_force_reset = uart4_force_reset,
    //uart release reset
    .uart_release_reset = uart4_release_reset,
    //TX gpio clock init
    .gpio_tx_clock_init = gpioa_clock_enable,
    //RX gpio clock init
    .gpio_rx_clock_init = gpioa_clock_enable,
    .data_available = 0,
    .begin = 0,
    .end = 0,
    .uart_option = NATIVE_UART_E
  }
};

static UART_Emul_HandleTypeDef g_UartEmulHandle[NB_UART_EMUL_MANAGED];

static uart_emul_conf_t g_uartEmul_config[NB_UART_EMUL_MANAGED] = {
  {
    .uartEmul_typedef = {UART1_EMUL_E},
    .tx_port = GPIOB, .tx_pin = {GPIO_PIN_3, GPIO_MODE_OUTPUT_PP, GPIO_PULLUP, GPIO_SPEED_FREQ_VERY_HIGH, GPIO_AF1_TIM8},
    .rx_port = GPIOA, .rx_pin = {GPIO_PIN_10, GPIO_MODE_IT_FALLING, GPIO_PULLUP, GPIO_SPEED_FREQ_VERY_HIGH, GPIO_AF1_TIM8},
    .gpio_tx_clock_init = gpiob_clock_enable,
    .gpio_rx_clock_init = gpioa_clock_enable,
    .uart_rx_irqHandle = NULL,
    .data_available = 0,
    .begin = 0,
    .end = 0,
    .uart_option = EMULATED_UART_E
  }
};

//@brief just a simple buffer for the uart reception
uint8_t g_rx_data[1];

/**
  * @}
  */

