fpistm/Arduino_Core_STM32L4/system/libstm32l4/source/uart.c
  }
#else
  HAL_NVIC_ClearPendingIRQ(USART1_IRQn);
  HAL_UART_IRQHandler(&g_UartHandle[USART1_E]);
#endif
}

/**
  * @brief  USART 2 IRQ handler
  * @param  None
  * @retval None
  */
void USART2_IRQHandler(void)
{
#ifdef UART_OPTIMIZED
  /* UART in mode Receiver ---------------------------------------------------*/
  if((__HAL_UART_GET_IT(&g_UartHandle[USART2_E], UART_IT_RXNE) != RESET) &&
     (__HAL_UART_GET_IT_SOURCE(&g_UartHandle[USART2_E], UART_IT_RXNE) != RESET))
  {
    uart_getc(USART2_E, (uint8_t)(g_UartHandle[USART2_E].Instance->RDR & 
                                                  (uint8_t)g_UartHandle[USART2_E].Mask));
    
    /* Enable the UART Data Register not empty Interrupt */
    __HAL_UART_ENABLE_IT(&g_UartHandle[USART2_E], UART_IT_RXNE);

    /* Clear RXNE interrupt flag */
    __HAL_UART_SEND_REQ(&g_UartHandle[USART2_E], UART_RXDATA_FLUSH_REQUEST);

  }
#else
  HAL_NVIC_ClearPendingIRQ(USART2_IRQn);
  HAL_UART_IRQHandler(&g_UartHandle[USART2_E]);
#endif
}


/**
  * @brief  UART 4 IRQ handler
  * @param  None
  * @retval None
  */
void UART4_IRQHandler(void)
{
#ifdef UART_OPTIMIZED
  /* UART in mode Receiver ---------------------------------------------------*/
  if((__HAL_UART_GET_IT(&g_UartHandle[UART4_E], UART_IT_RXNE) != RESET) &&
     (__HAL_UART_GET_IT_SOURCE(&g_UartHandle[UART4_E], UART_IT_RXNE) != RESET))
  {
    uart_getc(UART4_E, (uint8_t)(g_UartHandle[UART4_E].Instance->RDR & 
                                                (uint8_t)g_UartHandle[UART4_E].Mask));
    
    /* Enable the UART Data Register not empty Interrupt */
    __HAL_UART_ENABLE_IT(&g_UartHandle[UART4_E], UART_IT_RXNE);

    /* Clear RXNE interrupt flag */
    __HAL_UART_SEND_REQ(&g_UartHandle[UART4_E], UART_RXDATA_FLUSH_REQUEST);

  }
#else
  HAL_NVIC_ClearPendingIRQ(UART4_IRQn);
  HAL_UART_IRQHandler(&g_UartHandle[UART4_E]);
#endif
}


/******************************* EMULATED UART ********************************/
/**
  * @brief  Initializes the UART Emulation MSP.
  * @param  huart: UART Emulation Handle
  * @retval None
  */
void HAL_UART_Emul_MspInit(UART_Emul_HandleTypeDef *huart)
{
  /* Enable clock for UART Emul */
  __UART_EMUL_CLK_ENABLE();
  
  // Enable GPIO TX/RX clock
  g_uartEmul_config[UART1_EMUL_E].gpio_tx_clock_init();
  g_uartEmul_config[UART1_EMUL_E].gpio_rx_clock_init();
  
  // UART TX GPIO pin configuration
  HAL_GPIO_Init(g_uartEmul_config[UART1_EMUL_E].tx_port, &g_uartEmul_config[UART1_EMUL_E].tx_pin);

  // UART RX GPIO pin configuration
  HAL_GPIO_Init(g_uartEmul_config[UART1_EMUL_E].rx_port, &g_uartEmul_config[UART1_EMUL_E].rx_pin);
  
  stm32_interrupt_enable(g_uartEmul_config[UART1_EMUL_E].rx_port, g_uartEmul_config[UART1_EMUL_E].rx_pin.Pin, 
                          UART_EMUL_EXTI_RX, g_uartEmul_config[UART1_EMUL_E].rx_pin.Mode);
  /*HAL_NVIC_SetPriority(EXTI15_10_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(EXTI15_10_IRQn);*/
}

/**
 * @brief  UART Emulation MSP DeInit.
 * @param  huart: UART Emulation handle
 * @retval None
 */
void HAL_UART_Emul_MspDeInit(UART_Emul_HandleTypeDef *huart)
{
  __UART_EMUL_CLK_DISABLE();

  HAL_GPIO_DeInit(g_uartEmul_config[UART1_EMUL_E].tx_port, g_uartEmul_config[UART1_EMUL_E].tx_pin.Pin);
  HAL_GPIO_DeInit(g_uartEmul_config[UART1_EMUL_E].rx_port, g_uartEmul_config[UART1_EMUL_E].rx_pin.Pin);
  
  HAL_NVIC_DisableIRQ(EXTI15_10_IRQn);
}

/**
  * @brief  Function called to initialize the emulated uart interface
  * @param  serial_id : one of the defined serial interface
  * @param  baudRate : baudrate to apply to the uart : 4800 or 9600 //TODO bug if baud rate > 9600
  * @retval None
  */
void uart_emul_init(uart_emul_id_e uart_id, uint32_t baudRate)
{
  if(uart_id>=NB_UART_EMUL_MANAGED) {
    return;
  }
  
  g_UartEmulHandle[uart_id].Init.Mode         = UART_EMUL_MODE_TX_RX;
  g_UartEmulHandle[uart_id].Init.BaudRate     = baudRate;
  g_UartEmulHandle[uart_id].Init.WordLength   = UART_EMUL_WORDLENGTH_8B;
  g_UartEmulHandle[uart_id].Init.StopBits     = UART_EMUL_STOPBITS_1;
  g_UartEmulHandle[uart_id].Init.Parity       = UART_EMUL_PARITY_NONE;
  g_UartEmulHandle[uart_id].Init.RxPinNumber  = g_uartEmul_config[uart_id].rx_pin.Pin;
  g_UartEmulHandle[uart_id].Init.TxPinNumber  = g_uartEmul_config[uart_id].tx_pin.Pin;
  g_UartEmulHandle[uart_id].RxPortName        = g_uartEmul_config[uart_id].rx_port;
  g_UartEmulHandle[uart_id].TxPortName        = g_uartEmul_config[uart_id].tx_port;
  
  if(HAL_UART_Emul_Init(&g_UartEmulHandle[uart_id])!= HAL_OK) {
    return;
  }
  
  if (HAL_UART_Emul_Receive_DMA(&g_UartEmulHandle[uart_id], g_rx_data, 1) != HAL_OK) {
    return;
  }
  
  uart_emul_flush(uart_id);
}

/**
  * @brief  Function called to deinitialize the emulated uart interface
  * @param  serial_id : one of the defined serial interface
  * @retval None
  */
void uart_emul_deinit(uart_emul_id_e uart_id)
{
  if(uart_id>=NB_UART_EMUL_MANAGED) {
    return;
  }
  
  HAL_UART_Emul_DeInit(&g_UartEmulHandle[uart_id]);
}

/**
  * @brief  Function returns the amount of data available
  * @param  serial_id : one of the defined serial interface
  * @retval The number of serial data available - int
  */
int uart_emul_available(uart_emul_id_e uart_id)
{
  if(uart_id>=NB_UART_EMUL_MANAGED) {
    return 0;
  }
  
  return g_uartEmul_config[uart_id].data_available;
}

/**
  * @brief  Return the first element of the rx buffer
  * @param  serial_id : one of the defined serial interface
  * @retval The first byte of incoming serial data available (or -1 if no data is available) - int
  */
int8_t uart_emul_read(uart_emul_id_e uart_id)
{
  int8_t data = -1;
  
  if(uart_id>=NB_UART_EMUL_MANAGED) {
    return data;
  }

  if(g_uartEmul_config[uart_id].data_available > 0) {

    data = g_uartEmul_config[uart_id].rxpData[g_uartEmul_config[uart_id].begin++];

    if(g_uartEmul_config[uart_id].begin >= UART_RCV_SIZE) {
      g_uartEmul_config[uart_id].begin = 0;
    }
    
    g_uartEmul_config[uart_id].data_available--;
  }
  
  return data;
}

/**
  * @brief  write the data on the uart
  * @param  serial_id : one of the defined serial interface
  * @param  data : byte to write
  * @retval The number of bytes written
  */
size_t uart_emul_write(uart_emul_id_e uart_id, uint8_t data)
{
  if(uart_id>=NB_UART_EMUL_MANAGED) {
    return 0;
  }

